app/controllers/products_controller.rb

SELECT * FROM `products`
---
  def index
    @products = Product.all

INSERT INTO `products` (`name`, `brand`, `updated_at`, `price`, `quantity`, `sku`, `created_at`) VALUES('3', '3', '2013-05-11 03:34:15', '$3', '3', '3', '2013-05-11 03:34:15')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save